
const Detail = () => {

    return(
        <div className={"w-4/5 md:w-2/5 min-h-[95VH] h-auto mx-auto px-2 py-10"}>
            <div className={"w-full h-auto my-5 pb-7"}>
                <h1 className={"mb-0"}>
                    제목입니다.
                </h1>
                <p className={"text-md"}>
                    류재정, 3일전
                </p>
            </div>
            <div className={"w-full h-auto my-5 text-xl"}>
                <p>
                    함수형 프로그래밍을 하다보면 모나드를 접하게 되기 마련이다. 모나드가 무엇인지 설명하는 글은 많다. 하지만 그래서 모나드는 어디에 쓰는가 하면 뜬구름 잡는 이야기 같을 것이다. 이 글에서는 모나드의 사용 사례, 특히 React를 모나드로 해석하는 관점을 제시하고, 몇몇 마법적 동작을 기술적으로 해체한다. 이후, 모나드가 가진 의의를 설명한다.
                    <br /><br />함수형 프로그래밍을 하다보면 모나드를 접하게 되기 마련이다. 모나드가 무엇인지 설명하는 글은 많다. 하지만 그래서 모나드는 어디에 쓰는가 하면 뜬구름 잡는 이야기 같을 것이다. 이 글에서는 모나드의 사용 사례, 특히 React를 모나드로 해석하는 관점을 제시하고, 몇몇 마법적 동작을 기술적으로 해체한다. 이후, 모나드가 가진 의의를 설명한다.
                    <br /><br />함수형 프로그래밍을 하다보면 모나드를 접하게 되기 마련이다. 모나드가 무엇인지 설명하는 글은 많다. 하지만 그래서 모나드는 어디에 쓰는가 하면 뜬구름 잡는 이야기 같을 것이다. 이 글에서는 모나드의 사용 사례, 특히 React를 모나드로 해석하는 관점을 제시하고, 몇몇 마법적 동작을 기술적으로 해체한다. 이후, 모나드가 가진 의의를 설명한다.
                    <br /><br />함수형 프로그래밍을 하다보면 모나드를 접하게 되기 마련이다. 모나드가 무엇인지 설명하는 글은 많다. 하지만 그래서 모나드는 어디에 쓰는가 하면 뜬구름 잡는 이야기 같을 것이다. 이 글에서는 모나드의 사용 사례, 특히 React를 모나드로 해석하는 관점을 제시하고, 몇몇 마법적 동작을 기술적으로 해체한다. 이후, 모나드가 가진 의의를 설명한다.
                    <br /><br />함수형 프로그래밍을 하다보면 모나드를 접하게 되기 마련이다. 모나드가 무엇인지 설명하는 글은 많다. 하지만 그래서 모나드는 어디에 쓰는가 하면 뜬구름 잡는 이야기 같을 것이다. 이 글에서는 모나드의 사용 사례, 특히 React를 모나드로 해석하는 관점을 제시하고, 몇몇 마법적 동작을 기술적으로 해체한다. 이후, 모나드가 가진 의의를 설명한다.
                </p>
            </div>
        </div>
    )
}

export default Detail